zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100tp_64_tqfp.h
/* PORT 4 (GPIO) */
#define P4_0_PORT                       GPIO_PRT4
#define P4_0_PIN                        0u
#define P4_0_NUM                        0u
#define P4_0_AMUXSEGMENT                AMUXBUS_MSC
#define P4_1_PORT                       GPIO_PRT4
#define P4_1_PIN                        1u
#define P4_1_NUM                        1u
#define P4_1_AMUXSEGMENT                AMUXBUS_MSC
#define P4_2_PORT                       GPIO_PRT4
#define P4_2_PIN                        2u
#define P4_2_NUM                        2u
#define P4_2_AMUXSEGMENT                AMUXBUS_MSC
#define P4_3_PORT                       GPIO_PRT4
#define P4_3_PIN                        3u
#define P4_3_NUM                        3u
#define P4_3_AMUXSEGMENT                AMUXBUS_MSC
#define P4_4_PORT                       GPIO_PRT4
#define P4_4_PIN                        4u
#define P4_4_NUM                        4u
#define P4_4_AMUXSEGMENT                AMUXBUS_MSC
#define P4_5_PORT                       GPIO_PRT4
#define P4_5_PIN                        5u
#define P4_5_NUM                        5u
#define P4_5_AMUXSEGMENT                AMUXBUS_MSC
#define P4_6_PORT                       GPIO_PRT4
#define P4_6_PIN                        6u
#define P4_6_NUM                        6u
#define P4_6_AMUXSEGMENT                AMUXBUS_MSC
#define P4_7_PORT                       GPIO_PRT4
#define P4_7_PIN                        7u
#define P4_7_NUM                        7u
#define P4_7_AMUXSEGMENT                AMUXBUS_MSC

/* PORT 5 (GPIO) */
#define P5_0_PORT                       GPIO_PRT5
#define P5_0_PIN                        0u
#define P5_0_NUM                        0u
#define P5_0_AMUXSEGMENT                AMUXBUS_MSC
#define P5_1_PORT                       GPIO_PRT5
#define P5_1_PIN                        1u
#define P5_1_NUM                        1u
#define P5_1_AMUXSEGMENT                AMUXBUS_MSC
#define P5_2_PORT                       GPIO_PRT5
#define P5_2_PIN                        2u
#define P5_2_NUM                        2u
#define P5_2_AMUXSEGMENT                AMUXBUS_MSC
#define P5_3_PORT                       GPIO_PRT5
#define P5_3_PIN                        3u
#define P5_3_NUM                        3u
#define P5_3_AMUXSEGMENT                AMUXBUS_MSC
#define P5_4_PORT                       GPIO_PRT5
#define P5_4_PIN                        4u
#define P5_4_NUM                        4u
#define P5_4_AMUXSEGMENT                AMUXBUS_MSC
#define P5_5_PORT                       GPIO_PRT5
#define P5_5_PIN                        5u
#define P5_5_NUM                        5u
#define P5_5_AMUXSEGMENT                AMUXBUS_MSC
#define P5_6_PORT                       GPIO_PRT5
#define P5_6_PIN                        6u
#define P5_6_NUM                        6u
#define P5_6_AMUXSEGMENT                AMUXBUS_MSC
#define P5_7_PORT                       GPIO_PRT5
#define P5_7_PIN                        7u
#define P5_7_NUM                        7u
#define P5_7_AMUXSEGMENT                AMUXBUS_MSC

/* PORT 6 (GPIO) */
#define P6_0_PORT                       GPIO_PRT6
#define P6_0_PIN                        0u
#define P6_0_NUM                        0u
#define P6_0_AMUXSEGMENT                AMUXBUS_MSC
#define P6_1_PORT                       GPIO_PRT6
#define P6_1_PIN                        1u
#define P6_1_NUM                        1u
#define P6_1_AMUXSEGMENT                AMUXBUS_MSC
#define P6_2_PORT                       GPIO_PRT6
#define P6_2_PIN                        2u
#define P6_2_NUM                        2u
#define P6_2_AMUXSEGMENT                AMUXBUS_MSC
#define P6_3_PORT                       GPIO_PRT6
#define P6_3_PIN                        3u
#define P6_3_NUM                        3u
#define P6_3_AMUXSEGMENT                AMUXBUS_MSC
#define P6_4_PORT                       GPIO_PRT6
#define P6_4_PIN                        4u
#define P6_4_NUM                        4u
#define P6_4_AMUXSEGMENT                AMUXBUS_MSC

/* MSC List */
#define P0_0_MSCLP_MSC_GPIO_CTRL_SNS    0u
#define P0_1_MSCLP_MSC_GPIO_CTRL_SNS    1u
#define P0_2_MSCLP_MSC_GPIO_CTRL_SNS    2u
#define P0_3_MSCLP_MSC_GPIO_CTRL_SNS    3u
#define P0_4_MSCLP_MSC_GPIO_CTRL_SNS    4u
#define P0_5_MSCLP_MSC_GPIO_CTRL_SNS    5u
#define P0_6_MSCLP_MSC_GPIO_CTRL_SNS    6u
#define P0_7_MSCLP_MSC_GPIO_CTRL_SNS    7u
#define P1_0_MSCLP_MSC_GPIO_CTRL_CMOD   1u
#define P1_1_MSCLP_MSC_GPIO_CTRL_CMOD   2u
#define P1_2_MSCLP_MSC_GPIO_CTRL_SNS    8u
#define P1_3_MSCLP_MSC_GPIO_CTRL_SNS    9u
#define P1_4_MSCLP_MSC_GPIO_CTRL_SNS    10u
#define P1_5_MSCLP_MSC_GPIO_CTRL_SNS    11u
#define P1_6_MSCLP_MSC_GPIO_CTRL_SNS    12u
#define P1_7_MSCLP_MSC_GPIO_CTRL_SNS    13u
#define P2_0_MSCLP_MSC_GPIO_CTRL_SNS    14u
#define P2_1_MSCLP_MSC_GPIO_CTRL_SNS    15u
#define P2_2_MSCLP_MSC_GPIO_CTRL_SNS    16u
#define P2_3_MSCLP_MSC_GPIO_CTRL_SNS    17u
#define P2_4_MSCLP_MSC_GPIO_CTRL_SNS    18u
#define P2_5_MSCLP_MSC_GPIO_CTRL_SNS    19u
#define P2_6_MSCLP_MSC_GPIO_CTRL_SNS    20u
#define P2_7_MSCLP_MSC_GPIO_CTRL_SNS    21u
#define P3_1_MSCLP_MSC_GPIO_CTRL_SNS    22u
#define P3_2_MSCLP_MSC_GPIO_CTRL_SNS    23u
#define P3_3_MSCLP_MSC_GPIO_CTRL_SNS    24u
#define P4_0_MSCLP_MSC_GPIO_CTRL_SNS    25u
#define P4_1_MSCLP_MSC_GPIO_CTRL_SNS    26u
#define P4_2_MSCLP_MSC_GPIO_CTRL_SNS    27u
#define P4_3_MSCLP_MSC_GPIO_CTRL_SNS    28u
#define P4_4_MSCLP_MSC_GPIO_CTRL_SNS    29u
#define P4_5_MSCLP_MSC_GPIO_CTRL_SNS    30u
#define P4_6_MSCLP_MSC_GPIO_CTRL_SNS    31u

/* Analog Connections */
#define MSCLP_CMOD1PADD_CCOMP_PORT      1u
#define MSCLP_CMOD1PADD_CCOMP_PIN       0u
#define MSCLP_CMOD1PADD_CREF_PORT       1u
#define MSCLP_CMOD1PADD_CREF_PIN        0u
#define MSCLP_CMOD1PADS_PORT            1u
#define MSCLP_CMOD1PADS_PIN             0u
#define MSCLP_CMOD2PADD_CCOMP_PORT      1u
#define MSCLP_CMOD2PADD_CCOMP_PIN       1u
#define MSCLP_CMOD2PADD_CREF_PORT       1u
#define MSCLP_CMOD2PADD_CREF_PIN        1u
#define MSCLP_CMOD2PADS_PORT            1u
#define MSCLP_CMOD2PADS_PIN             1u
#define PASS0_SAR_EXT_VREF0_PORT        1u
#define PASS0_SAR_EXT_VREF0_PIN         7u
#define PASS0_SAR_EXT_VREF1_PORT        1u
#define PASS0_SAR_EXT_VREF1_PIN         7u
#define PASS0_SARMUX_PADS0_PORT         2u
#define PASS0_SARMUX_PADS0_PIN          0u
#define PASS0_SARMUX_PADS1_PORT         2u
#define PASS0_SARMUX_PADS1_PIN          1u
#define PASS0_SARMUX_PADS2_PORT         2u
#define PASS0_SARMUX_PADS2_PIN          2u
#define PASS0_SARMUX_PADS3_PORT         2u
#define PASS0_SARMUX_PADS3_PIN          3u
#define PASS0_SARMUX_PADS4_PORT         2u
#define PASS0_SARMUX_PADS4_PIN          4u
#define PASS0_SARMUX_PADS5_PORT         2u
#define PASS0_SARMUX_PADS5_PIN          5u
#define PASS0_SARMUX_PADS6_PORT         2u
#define PASS0_SARMUX_PADS6_PIN          6u
#define PASS0_SARMUX_PADS7_PORT         2u
#define PASS0_SARMUX_PADS7_PIN          7u
#define SRSS_ADFT_POR_PAD_HV_PORT       0u
#define SRSS_ADFT_POR_PAD_HV_PIN        4u
#define WCO_WCO_IN_PORT                 0u
#define WCO_WCO_IN_PIN                  2u
#define WCO_WCO_OUT_PORT                0u
#define WCO_WCO_OUT_PIN                 3u

/* HSIOM Connections */
typedef enum
{
    /* Generic HSIOM connections */
    HSIOM_SEL_GPIO                  =  0,       /* SW controlled GPIO. */
    HSIOM_SEL_GPIO_DSI              =  1,       /* SW controlled 'out', DSI controlled 'oe_n'. */
    HSIOM_SEL_DSI_DSI               =  2,       /* DSI controlled 'out' and 'oe_n'. */
    HSIOM_SEL_DSI_GPIO              =  3,       /* DSI controlled 'out', SW controlled 'oe_n'. */
    HSIOM_SEL_CSD_SENSE             =  4,       /* CSD sense connection (analog mode) */
    HSIOM_SEL_CSD_SHIELD            =  5,       /* CSD shield connection (analog mode) */
    HSIOM_SEL_AMUXA                 =  6,       /* AMUXBUS A connection. */
    HSIOM_SEL_AMUXB                 =  7,       /* AMUXBUS B connection. */
    HSIOM_SEL_ACT_0                 =  8,       /* Chip specific Active source 0 connection. */
    HSIOM_SEL_ACT_1                 =  9,       /* Chip specific Active source 1 connection. */
    HSIOM_SEL_ACT_2                 = 10,       /* Chip specific Active source 2 connection. */
    HSIOM_SEL_ACT_3                 = 11,       /* Chip specific Active source 3 connection. */
    HSIOM_SEL_LCD_COM               = 12,       /* LCD common connection. */
    HSIOM_SEL_LCD_SEG               = 13,       /* LCD segment connection. */
    HSIOM_SEL_DS_0                  = 12,       /* Chip specific DeepSleep source 0 connection. */
    HSIOM_SEL_DS_1                  = 13,       /* Chip specific DeepSleep source 1 connection. */
    HSIOM_SEL_DS_2                  = 14,       /* Chip specific DeepSleep source 2 connection. */
    HSIOM_SEL_DS_3                  = 15,       /* Chip specific DeepSleep source 3 connection. */

    /* P0.0 */
    P0_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_0_MSCLP_SENSE                =  4,       /* msclp.sense:0 */
    P0_0_MSCLP_SHIELD               =  5,       /* msclp.shield:0 */
    P0_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_0_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:0 */
    P0_0_SCB0_UART_RX               =  9,       /* Digital Active - scb[0].uart_rx:0 */
    P0_0_PASS0_DSI_SAR_DATA_VALID   = 10,       /* Digital Active - pass[0].dsi_sar_data_valid */
    P0_0_TCPWM_TR_IN0               = 11,       /* Digital Active - tcpwm.tr_in[0]:0 */
    P0_0_MSCLP_MSC_DDRV0            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[0] */
    P0_0_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:0 */
    P0_0_SCB0_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[0].spi_select0:0 */

    /* P0.1 */
    P0_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_1_MSCLP_SENSE                =  4,       /* msclp.sense:1 */
    P0_1_MSCLP_SHIELD               =  5,       /* msclp.shield:1 */
    P0_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_1_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:0 */
    P0_1_SCB0_UART_TX               =  9,       /* Digital Active - scb[0].uart_tx:0 */
    P0_1_PASS0_TR_SAR_OUT           = 10,       /* Digital Active - pass[0].tr_sar_out */
    P0_1_TCPWM_TR_IN1               = 11,       /* Digital Active - tcpwm.tr_in[1]:0 */
    P0_1_MSCLP_MSC_DDRV1            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[1] */
    P0_1_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:0 */
    P0_1_SCB0_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[0].spi_select1:0 */

