zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100tp_64_tqfp.h
    /* P0.2 */
    P0_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_2_MSCLP_SENSE                =  4,       /* msclp.sense:2 */
    P0_2_MSCLP_SHIELD               =  5,       /* msclp.shield:2 */
    P0_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_2_SCB0_UART_CTS              =  9,       /* Digital Active - scb[0].uart_cts:0 */
    P0_2_PASS0_DSI_SAR_SAMPLE_DONE  = 10,       /* Digital Active - pass[0].dsi_sar_sample_done */
    P0_2_MSCLP_MSC_DDRV2            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[2] */
    P0_2_SCB0_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[0].spi_select2:0 */

    /* P0.3 */
    P0_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_3_MSCLP_SENSE                =  4,       /* msclp.sense:3 */
    P0_3_MSCLP_SHIELD               =  5,       /* msclp.shield:3 */
    P0_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_3_SCB0_UART_RTS              =  9,       /* Digital Active - scb[0].uart_rts:0 */
    P0_3_PASS0_DSI_SAR_DATA0        = 10,       /* Digital Active - pass[0].dsi_sar_data[0] */
    P0_3_MSCLP_MSC_DDRV3            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[3] */
    P0_3_SCB0_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[0].spi_select3:0 */

    /* P0.4 */
    P0_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_4_MSCLP_SENSE                =  4,       /* msclp.sense:4 */
    P0_4_MSCLP_SHIELD               =  5,       /* msclp.shield:4 */
    P0_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_4_SRSS_EXT_CLK               =  8,       /* Digital Active - srss.ext_clk */
    P0_4_PASS0_DSI_SAR_DATA1        = 10,       /* Digital Active - pass[0].dsi_sar_data[1] */
    P0_4_MSCLP_MSC_DDRV4            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[4] */
    P0_4_SCB0_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[0].spi_mosi:0 */

    /* P0.5 */
    P0_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_5_MSCLP_SENSE                =  4,       /* msclp.sense:5 */
    P0_5_MSCLP_SHIELD               =  5,       /* msclp.shield:5 */
    P0_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_5_MSCLP_MSC_DDRV5            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[5] */
    P0_5_SCB0_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[0].spi_miso:0 */

    /* P0.6 */
    P0_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_6_MSCLP_SENSE                =  4,       /* msclp.sense:6 */
    P0_6_MSCLP_SHIELD               =  5,       /* msclp.shield:6 */
    P0_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_6_TCPWM_LINE1                =  8,       /* Digital Active - tcpwm.line[1]:0 */
    P0_6_MSCLP_MSC_DDRV6            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[6] */
    P0_6_SCB0_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[0].spi_clk:0 */

    /* P0.7 */
    P0_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_7_MSCLP_SENSE                =  4,       /* msclp.sense:7 */
    P0_7_MSCLP_SHIELD               =  5,       /* msclp.shield:7 */
    P0_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_7_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:0 */
    P0_7_MSCLP_MSC_DDRV7            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[7] */

    /* P1.0 */
    P1_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_0_MSCLP_SENSE                =  4,       /* msclp.sense:8 */
    P1_0_MSCLP_SHIELD               =  5,       /* msclp.shield:8 */
    P1_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_0_MSCLP_MSC_CMOD1_DDRV       = 12,       /* Digital Deep Sleep - msclp.msc_cmod1_ddrv */

    /* P1.1 */
    P1_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_1_MSCLP_SENSE                =  4,       /* msclp.sense:9 */
    P1_1_MSCLP_SHIELD               =  5,       /* msclp.shield:9 */
    P1_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_1_MSCLP_MSC_CMOD2_DDRV       = 12,       /* Digital Deep Sleep - msclp.msc_cmod2_ddrv */

    /* P1.2 */
    P1_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_2_MSCLP_SENSE                =  4,       /* msclp.sense:10 */
    P1_2_MSCLP_SHIELD               =  5,       /* msclp.shield:10 */
    P1_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_2_MSCLP_MSC_DDRV8            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[8] */

    /* P1.3 */
    P1_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_3_MSCLP_SENSE                =  4,       /* msclp.sense:11 */
    P1_3_MSCLP_SHIELD               =  5,       /* msclp.shield:11 */
    P1_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_3_MSCLP_MSC_DDRV9            = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[9] */
    P1_3_SCB1_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[1].spi_select0:0 */

    /* P1.4 */
    P1_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_4_MSCLP_SENSE                =  4,       /* msclp.sense:12 */
    P1_4_MSCLP_SHIELD               =  5,       /* msclp.shield:12 */
    P1_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_4_SCB1_UART_RX               =  9,       /* Digital Active - scb[1].uart_rx:0 */
    P1_4_PASS0_DSI_SAR_DATA2        = 10,       /* Digital Active - pass[0].dsi_sar_data[2]:0 */
    P1_4_TCPWM_TR_IN2               = 11,       /* Digital Active - tcpwm.tr_in[2]:0 */
    P1_4_MSCLP_MSC_DDRV10           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[10] */
    P1_4_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:0 */
    P1_4_SCB1_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[1].spi_select1:0 */

