zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100tp_64_tqfp.h
    /* P4.1 */
    P4_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_1_MSCLP_SENSE                =  4,       /* msclp.sense:28 */
    P4_1_MSCLP_SHIELD               =  5,       /* msclp.shield:28 */
    P4_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_1_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:1 */
    P4_1_SCB4_UART_TX               =  9,       /* Digital Active - scb[4].uart_tx:0 */
    P4_1_PASS0_DSI_SAR_DATA11       = 10,       /* Digital Active - pass[0].dsi_sar_data[11]:0 */
    P4_1_TCPWM_TR_IN4               = 11,       /* Digital Active - tcpwm.tr_in[4]:1 */
    P4_1_MSCLP_MSC_DDRV26           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[26] */
    P4_1_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:1 */
    P4_1_SCB1_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[1].spi_select1:1 */

    /* P4.2 */
    P4_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_2_MSCLP_SENSE                =  4,       /* msclp.sense:29 */
    P4_2_MSCLP_SHIELD               =  5,       /* msclp.shield:29 */
    P4_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_2_TCPWM_LINE2                =  8,       /* Digital Active - tcpwm.line[2]:1 */
    P4_2_SCB4_UART_CTS              =  9,       /* Digital Active - scb[4].uart_cts:0 */
    P4_2_MSCLP_MSC_DDRV27           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[27] */
    P4_2_SCB1_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[1].spi_select2:0 */

    /* P4.3 */
    P4_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_3_MSCLP_SENSE                =  4,       /* msclp.sense:30 */
    P4_3_MSCLP_SHIELD               =  5,       /* msclp.shield:30 */
    P4_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_3_TCPWM_LINE_COMPL2          =  8,       /* Digital Active - tcpwm.line_compl[2]:1 */
    P4_3_SCB4_UART_RTS              =  9,       /* Digital Active - scb[4].uart_rts:0 */
    P4_3_MSCLP_MSC_DDRV28           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[28] */
    P4_3_SCB1_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[1].spi_select3:0 */

    /* P4.4 */
    P4_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_4_MSCLP_SENSE                =  4,       /* msclp.sense:31 */
    P4_4_MSCLP_SHIELD               =  5,       /* msclp.shield:31 */
    P4_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_4_TCPWM_LINE3                =  8,       /* Digital Active - tcpwm.line[3]:1 */
    P4_4_TCPWM_TR_IN5               = 11,       /* Digital Active - tcpwm.tr_in[5]:1 */
    P4_4_MSCLP_MSC_DDRV29           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[29] */
    P4_4_SCB1_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[1].spi_mosi:1 */

    /* P4.5 */
    P4_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_5_MSCLP_SENSE                =  4,       /* msclp.sense:32 */
    P4_5_MSCLP_SHIELD               =  5,       /* msclp.shield:32 */
    P4_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_5_TCPWM_LINE_COMPL3          =  8,       /* Digital Active - tcpwm.line_compl[3]:1 */
    P4_5_TCPWM_TR_IN6               = 11,       /* Digital Active - tcpwm.tr_in[6]:1 */
    P4_5_MSCLP_MSC_DDRV30           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[30] */
    P4_5_SCB1_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[1].spi_miso:1 */

    /* P4.6 */
    P4_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_6_MSCLP_SENSE                =  4,       /* msclp.sense:33 */
    P4_6_MSCLP_SHIELD               =  5,       /* msclp.shield:33 */
    P4_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_6_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:1 */
    P4_6_MSCLP_MSC_DDRV31           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[31] */
    P4_6_SCB1_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[1].spi_clk:1 */

    /* P4.7 */
    P4_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_7_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:1 */

    /* P5.0 */
    P5_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_0_AMUXB                      =  7,       /* AMUXBUS B connection. */

    /* P5.1 */
    P5_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_1_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:1 */
    P5_1_SCB0_UART_RX               =  9,       /* Digital Active - scb[0].uart_rx:1 */
    P5_1_TCPWM_TR_IN0               = 11,       /* Digital Active - tcpwm.tr_in[0]:2 */
    P5_1_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:2 */
    P5_1_SCB1_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[1].spi_mosi:2 */

    /* P5.2 */
    P5_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_2_TCPWM_LINE_COMPL5          =  8,       /* Digital Active - tcpwm.line_compl[5]:1 */
    P5_2_SCB0_UART_TX               =  9,       /* Digital Active - scb[0].uart_tx:1 */
    P5_2_TCPWM_TR_IN1               = 11,       /* Digital Active - tcpwm.tr_in[1]:2 */
    P5_2_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:2 */
    P5_2_SCB1_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[1].spi_miso:2 */

    /* P5.3 */
    P5_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_3_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:2 */
    P5_3_SCB0_UART_CTS              =  9,       /* Digital Active - scb[0].uart_cts:1 */
    P5_3_TCPWM_TR_IN2               = 11,       /* Digital Active - tcpwm.tr_in[2]:2 */
    P5_3_SCB1_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[1].spi_clk:2 */

    /* P5.4 */
    P5_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_4_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:2 */
    P5_4_SCB0_UART_RTS              =  9,       /* Digital Active - scb[0].uart_rts:1 */
    P5_4_TCPWM_TR_IN3               = 11,       /* Digital Active - tcpwm.tr_in[3]:2 */
    P5_4_SCB1_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[1].spi_select0:2 */

    /* P5.5 */
    P5_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_5_TCPWM_LINE1                =  8,       /* Digital Active - tcpwm.line[1]:2 */
    P5_5_SCB1_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[1].spi_select1:2 */

