zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100tp_64_tqfp.h
    /* P5.6 */
    P5_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_6_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:2 */
    P5_6_SCB1_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[1].spi_select2:1 */

    /* P5.7 */
    P5_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_7_SCB1_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[1].spi_select3:1 */

    /* P6.0 */
    P6_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_0_TCPWM_LINE2                =  8,       /* Digital Active - tcpwm.line[2]:2 */
    P6_0_SCB1_UART_RX               =  9,       /* Digital Active - scb[1].uart_rx:1 */
    P6_0_TCPWM_TR_IN4               = 11,       /* Digital Active - tcpwm.tr_in[4]:2 */
    P6_0_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:3 */
    P6_0_SCB0_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[0].spi_select0:3 */

    /* P6.1 */
    P6_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_1_TCPWM_LINE_COMPL2          =  8,       /* Digital Active - tcpwm.line_compl[2]:2 */
    P6_1_SCB1_UART_TX               =  9,       /* Digital Active - scb[1].uart_tx:1 */
    P6_1_TCPWM_TR_IN5               = 11,       /* Digital Active - tcpwm.tr_in[5]:2 */
    P6_1_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:3 */
    P6_1_SCB0_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[0].spi_select1:3 */

    /* P6.2 */
    P6_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_2_TCPWM_LINE3                =  8,       /* Digital Active - tcpwm.line[3]:2 */
    P6_2_SCB1_UART_CTS              =  9,       /* Digital Active - scb[1].uart_cts:1 */
    P6_2_TCPWM_TR_IN6               = 11,       /* Digital Active - tcpwm.tr_in[6]:2 */
    P6_2_SCB0_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[0].spi_mosi:3 */

    /* P6.3 */
    P6_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_3_TCPWM_LINE_COMPL3          =  8,       /* Digital Active - tcpwm.line_compl[3]:2 */
    P6_3_SCB1_UART_RTS              =  9,       /* Digital Active - scb[1].uart_rts:1 */
    P6_3_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:3 */
    P6_3_SCB0_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[0].spi_miso:3 */

    /* P6.4 */
    P6_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_4_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:2 */
    P6_4_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:3 */
    P6_4_SCB0_SPI_CLK               = 15        /* Digital Deep Sleep - scb[0].spi_clk:3 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4100TP_64_TQFP_H_ */


/* [] END OF FILE */
